# Дано 2 числа a и b
a = 10
b = 15

# Найдем сумму и произведение чисел a и b
sum_ab = a + b
mul_ab = a * b

# Используя метод format() выведем на печать результаты
print("Сумма {} + {} = {}".format(a, b, sum_ab),
      "\nПроизведение {} * {} = {}".format(a, b, mul_ab)
      )
