# Дана сторона квадрата
side_square = 7

# Найдем периметр, площадь и диагональ квадрата
perimeter_square = 4 * side_square
area_square = side_square ** 2
diagonal_square = side_square * (2 ** 0.5)

# Выведем на печать результаты
print('Периметр квадрата равен:', perimeter_square,
      '\nПлощадь квадрата равна:', area_square,
      '\nДиагональ квадрата равна:', diagonal_square)
