# Дана строка a
a = 'автотестирование'

# С помощью среза только четных значений индексов создадим новую строку
result = a[::2]

# Выведем на печать результаты
print('Строка с четными значениями индексов:', result)
