# Дана сторона квадрата, найдем его периметр, площадь и диагональ
side_square = 7

perimeter_square = 4 * side_square
area_square = side_square ** 2
diagonal_square = side_square * (2 ** 0.5)
print('Периметр квадрата равен:', perimeter_square,
      '\nПлощадь квадрата равна:', area_square,
      '\nДиагональ квадрата равна:', diagonal_square)
